k6/path/get_paths_load.log

          /\      |‾‾| /‾‾/   /‾‾/
     /\  /  \     |  |/  /   /  /
    /  \/    \    |     (   /   ‾‾\
   /          \   |  |\  \ |  (‾)  |
  / __________ \  |__| \__\ \_____/ .io

  execution: local
     script: get_paths_load.js
     output: InfluxDBv1 (http://3.39.80.206:8086)

  scenarios: (100.00%) 1 scenario, 70 max VUs, 12m40s max duration (incl. graceful stop):
           * default: Up to 70 looping VUs for 12m10s over 5 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (12m10.3s), 00/70 VUs, 32262 complete and 0 interrupted iterations
default ✓ [======================================] 00/70 VUs  12m10s

     ✗ response code 200
      ↳  60% — ✓ 19367 / ✗ 12895

     checks.........................: 60.03% ✓ 19367     ✗ 12895
     data_received..................: 57 MB  78 kB/s
     data_sent......................: 4.7 MB 6.5 kB/s
     http_req_blocked...............: avg=84.97µs min=1µs  med=6µs     max=127.19ms p(90)=10µs    p(95)=11µs
     http_req_connecting............: avg=21.8µs  min=0s   med=0s      max=101.99ms p(90)=0s      p(95)=0s
   ✗ http_req_duration..............: avg=49.7ms  min=64µs med=40.66ms max=384.92ms p(90)=89.91ms p(95)=104.46ms
       { expected_response:true }...: avg=54.41ms min=64µs med=44.45ms max=384.92ms p(90)=93.34ms p(95)=108.3ms
     http_req_failed................: 39.96% ✓ 12895     ✗ 19367
     http_req_receiving.............: avg=81.07µs min=17µs med=76µs    max=7.99ms   p(90)=120µs   p(95)=130µs
     http_req_sending...............: avg=28.03µs min=5µs  med=27µs    max=1.07ms   p(90)=40µs    p(95)=43µs
     http_req_tls_handshaking.......: avg=55.35µs min=0s   med=0s      max=103.67ms p(90)=0s      p(95)=0s
     http_req_waiting...............: avg=49.59ms min=0s   med=40.53ms max=384.84ms p(90)=89.82ms p(95)=104.37ms
     http_reqs......................: 32262  44.173792/s
     iteration_duration.............: avg=1.05s   min=1s   med=1.04s   max=1.38s    p(90)=1.09s   p(95)=1.1s
     iterations.....................: 32262  44.173792/s
     vus............................: 3      min=1       max=70
     vus_max........................: 70     min=70      max=70

ERRO[0731] some thresholds have failed