k6/path/smoke-path.log

          /\      |‾‾| /‾‾/   /‾‾/
     /\  /  \     |  |/  /   /  /
    /  \/    \    |     (   /   ‾‾\
   /          \   |  |\  \ |  (‾)  |
  / __________ \  |__| \__\ \_____/ .io

  execution: local
     script: smoke-path.js
     output: -

  scenarios: (100.00%) 1 scenario, 1 max VUs, 40s max duration (incl. graceful stop):
           * default: 1 looping VUs for 10s (gracefulStop: 30s)


running (10.0s), 0/1 VUs, 10 complete and 0 interrupted iterations
default ✓ [======================================] 1 VUs  10s

     ✓ is ok

     checks.........................: 100.00% ✓ 10       ✗ 0
     data_received..................: 12 kB   1.2 kB/s
     data_sent......................: 1.5 kB  147 B/s
     http_req_blocked...............: avg=381.78µs min=6.41µs  med=6.81µs  max=3.74ms   p(90)=390.66µs p(95)=2.06ms
     http_req_connecting............: avg=58.24µs  min=0s      med=0s      max=582.47µs p(90)=58.24µs  p(95)=320.35µs
   ✓ http_req_duration..............: avg=1.75ms   min=1.62ms  med=1.71ms  max=2.13ms   p(90)=1.83ms   p(95)=1.98ms
       { expected_response:true }...: avg=1.75ms   min=1.62ms  med=1.71ms  max=2.13ms   p(90)=1.83ms   p(95)=1.98ms
     http_req_failed................: 0.00%   ✓ 0        ✗ 10
     http_req_receiving.............: avg=65.25µs  min=58.04µs med=63.48µs max=79.26µs  p(90)=73.59µs  p(95)=76.42µs
     http_req_sending...............: avg=28.75µs  min=17.21µs med=22.68µs max=62.22µs  p(90)=41.44µs  p(95)=51.83µs
     http_req_tls_handshaking.......: avg=0s       min=0s      med=0s      max=0s       p(90)=0s       p(95)=0s
     http_req_waiting...............: avg=1.65ms   min=1.52ms  med=1.62ms  max=2.04ms   p(90)=1.75ms   p(95)=1.89ms
     http_reqs......................: 10      0.997072/s
     iteration_duration.............: avg=1s       min=1s      med=1s      max=1s       p(90)=1s       p(95)=1s
     iterations.....................: 10      0.997072/s
     vus............................: 1       min=1      max=1
     vus_max........................: 1       min=1      max=1